// ПРЕМЕННЫЕ И ТИПЫ ДАННЫХ

let userName = 'Art';
let userAge = 31;
console.log(userName + ' is ' + userAge + ' years old');

/*
    let - объявление (создание) переменной
    userName - имя переменной (его вы придумываете сами)
    = - оператор присвоения
    'Art' - строка из трех символов

*/

console.log(1 + 1); // 2
console.log(1 - 1); // 0
console.log(4 / 2); // 2
console.log(3 * 3); // 9

/* UNDEFINED и NULL

undefined - cпециальное значение, формирует тип из самого себя. Оно означает, что «значение не было присвоено». Если переменная объявлена, но ей не присвоено никакого значения, то её значением будет undefined
null - специальное значение, формирует тип из самого себя. Представляет собой «ничего», «пусто» или «значение неизвестно».
Разница в том, что null - определенное нулевое значение, undefined - неопределенное. 
*/


/* КОНСТАНТЫ

Чтобы объявить константную, то есть, неизменяемую переменную, используйте const вместо let:
Переменные, объявленные с помощью const, называются «константами». Их нельзя изменить. Попытка сделать это приведёт к ошибке
*/

